In [1]:
import pandas as pd

In [9]:
df1 = pd.DataFrame({
    "city" : ["Mumbai","Delhi","Pune"],
    "temprature" : [34,36,32],
    
})
df1

     city  temprature
0  Mumbai          34
1   Delhi          36
2    Pune          32

In [12]:
df2 = pd.DataFrame({
    "city" : ["Mumbai","Delhi","Pune"],
    "humidity" : [22,24,20],
    
})
df2

     city  humidity
0  Mumbai        22
1   Delhi        24
2    Pune        20

In [13]:
df = pd.merge(df1,df2,on="city")
df

     city  temprature  humidity
0  Mumbai          34        22
1   Delhi          36        24
2    Pune          32        20

In [14]:
df1 = pd.DataFrame({
    "city" : ["Mumbai","Delhi","Pune"],
    "temprature" : [34,36,32],
    
})
df1

     city  temprature
0  Mumbai          34
1   Delhi          36
2    Pune          32

In [15]:
df2 = pd.DataFrame({
    "city" : ["Mumbai","Delhi","nashik"],
    "humidity" : [22,24,20],
    
})
df2

     city  humidity
0  Mumbai        22
1   Delhi        24
2  nashik        20

In [16]:
df = pd.merge(df1,df2,on="city")
df

     city  temprature  humidity
0  Mumbai          34        22
1   Delhi          36        24

In [17]:
df = pd.merge(df1,df2,on="city",how="left")
df

     city  temprature  humidity
0  Mumbai          34      22.0
1   Delhi          36      24.0
2    Pune          32       NaN

In [18]:
df = pd.merge(df1,df2,on="city",how="right")
df

     city  temprature  humidity
0  Mumbai        34.0        22
1   Delhi        36.0        24
2  nashik         NaN        20

In [19]:
df = pd.merge(df1,df2,on="city",how="outer")
df

     city  temprature  humidity
0  Mumbai        34.0      22.0
1   Delhi        36.0      24.0
2    Pune        32.0       NaN
3  nashik         NaN      20.0

In [20]:
df = pd.merge(df1,df2,on="city",how="outer",indicator=True)
df

     city  temprature  humidity      _merge
0  Mumbai        34.0      22.0        both
1   Delhi        36.0      24.0        both
2    Pune        32.0       NaN   left_only
3  nashik         NaN      20.0  right_only

In [21]:
India_weather = pd.DataFrame({
    "city" : ["Mumbai","Delhi","Pune"],
    "temprature" : [34,36,32],
    "humidity" : [80,70,75]
})
India_weather

     city  temprature  humidity
0  Mumbai          34        80
1   Delhi          36        70
2    Pune          32        75

In [27]:
US_weather = pd.DataFrame({
    "city" : ["Mumbai","Pune","Chiplun"],
    "temprature" : [22,24,20],
    "humidity" : [68,72,64]
})
US_weather

      city  temprature  humidity
0   Mumbai          22        68
1     Pune          24        72
2  Chiplun          20        64

In [28]:
df3 = pd.merge(India_weather,US_weather,on="city")
df3

     city  temprature_x  humidity_x  temprature_y  humidity_y
0  Mumbai            34          80            22          68
1    Pune            32          75            24          72

In [32]:
df3 = pd.merge(India_weather,US_weather,on="city",suffixes=("_left","_right"))
df3

     city  temprature_left  humidity_left  temprature_right  humidity_right
0  Mumbai               34             80                22              68
1    Pune               32             75                24              72